/**
 * Пакет entity содержит классы, представляющие сущности предметной области.
 * Основные классы:
 * <ul>
 *   <li>{@link se.ifmo.entity.Coordinates} - Класс, представляющий координаты.</li>
 *   <li>{@link se.ifmo.entity.Difficulty} - Перечисление, представляющее уровень сложности.</li>
 *   <li>{@link se.ifmo.entity.LabWork} - Класс, представляющий лабораторную работу.</li>
 *   <li>{@link se.ifmo.entity.Person} - Класс, представляющий человека.</li>
 * </ul>
 *
 * Эти классы используются для хранения и манипулирования данными приложения.
 */
package se.ifmo.entity;
